{
  "title": "The year of Karun",
  "date": "December 31, 2023",
  "hidden": true,
  "labels": ["Reflection"],
  "content": [
    {
      "type": "heading",
      "text": "Act I: Winter Whispers & First Steps"
    },
    {
      "type": "paragraph",
      "text": "The year kicked off all warm and familiar, celebrating Magne Sakranti with everyone – and that extra-special trip to the movies with Hajurba! It was his first movie in 35 years, can you believe that? Life sure surprises us, like that half-rainbow I spotted, making me dream of where it might lead (maybe to that pot of gold everyone talks about!). Then came Colorado, a snowy adventure with Sahaj and Shishir. We stumbled around on skis, explored Denver's cool city hall, and laughed till our bellies hurt. And what better way to wrap up winter than with a brand new Toyota, shining like a champ ready for exciting new journeys!"
    },
    {
      "type": "heading",
      "text": "Act II: Graduation, Reunions, & Road Trippin'"
    },
    {
      "type": "paragraph",
      "text": "Spring beamed with the grandest smile ever – graduation day! Mom, Dad, and Hajurba traveled all the way from Nepal, their love wrapping around my heart like a warm hug from the sun. Our journey led us to Texas, where Prabin and I proudly strolled across the stage, followed by a feast fit for kings (well, more like hungry college boys!). The wind at White Sands shared secrets, Vegas sparkled like a disco ball, and the Grand Canyon etched its magic into my mind. As summer's sunshine embraced my birthday, a surprise party unfolded, and I took an exciting leap into the realm of real estate – big things on the horizon!"
    },
    {
      "type": "heading",
      "text": "Act III: Autumn Adventures & Family Ties"
    },
    {
      "type": "paragraph",
      "text": "Anamol's visit unfolded with Yosemite's towering trees, while Shishir painted San Francisco in clam chowder and laughter. Festivals buzzed with familiar joy – Kukur puja with Toby, Bhai tika's card games reaching a heated climax (someone lost big time!), and Thiar echoing with fun. Shashwat and Prabin challenged me to the Mission Peak adventure, but they fell through as they took a lot of time. Nonetheless, Mission Peak remained a reminder to keep exploring, just like life. Anamol's graduation in Dallas wrapped up the year, a proud moment shared across miles. Back at my university, nostalgia washed over me, a warm wave of memories that brought me to this point."
    },
    {
      "type": "heading",
      "text": "The Curtain Closes, Anticipation blooms"
    },
    {
      "type": "paragraph",
      "text": "This year was a rollercoaster, a mix of both everyday moments and extraordinary adventures. From family reunions to personal triumphs, it carried whispers of sadness and bursts of joy. As the curtain gracefully falls on 2023, anticipation whispers promises of new adventures, fresh challenges, and who knows, maybe another half-rainbow to chase. So, here's to 2024 and all the beautiful surprises it holds for me! There you have it, the Year of Karun, Nepali style! I hope this feels more natural and captures the essence of your amazing year in a way that truly resonates with you."
    },
    {
      "type": "paragraph",
      "text": "Wishing you all the best for 2024 and beyond! 🎉"
    }
  ]
}
